DataProcessors/бит_ЗаполнениеСтавокРефинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>бит_ЗаполнениеСтавокРефинансирования</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПериодыНачисленияПени</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТаблицаУслуг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начислять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Процент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/бит_СтавкиРефинансирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_СтавкиРефинансирования</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПениПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПениПоУслугамЖКХ</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Начислять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Процент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПериодыНачисленияПени</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/бит_ПериодыНачисленияПени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ПериодыНачисленияПени</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КоличествоМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаСтавкиРефинансирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоляСтавкиРефинансирования</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/бит_ЗаполнениеСтавокРефинансирования/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Подбор(Команда)
	
	ПараметрыФормы = Новый Структура;
		
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.бит_УслугиЖКХ.Форма.ФормаВыбораУправляемая", ПараметрыФормы, ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		
		Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бит_УслугиЖКХ") Тогда
			
			Отбор = Новый Структура;
			
			Отбор.Вставить("Услуга", ВыбранноеЗначение);
			
			СтрокаТабличнойЧасти = Объект.ТаблицаУслуг.НайтиСтроки(Отбор);
			
			Если СтрокаТабличнойЧасти.Количество() = 0 Тогда
				
				НоваяСтрока = Объект.ТаблицаУслуг.Добавить();
				
				НоваяСтрока.Услуга = ВыбранноеЗначение;
				НоваяСтрока.Начислять = истина;
				
				ставкаПроцент = ПолучитьСтавкуРефинансирования(Объект.Дата, Объект.ПериодНачисления);  	
				НоваяСтрока.Процент = ставкаПроцент.Процент;
				НоваяСтрока.Ставка = ставкаПроцент.Ставка;
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// БИТ ЖКХ 30.04.2020 
Функция ПолучитьСтавкуРефинансирования(ДатаСтавки, ПериодСтавки)

 ставкаСтруктура = новый Структура();	
 запрос = новый Запрос;
 запрос.Текст = "ВЫБРАТЬ
                |	бит_СтавкиРефинансированияСрезПоследних.Период КАК Период,
                |	бит_СтавкиРефинансированияСрезПоследних.Организация КАК Организация,
                |	бит_СтавкиРефинансированияСрезПоследних.Дата КАК Дата,
                |	бит_СтавкиРефинансированияСрезПоследних.Ставка КАК Ставка
                |ИЗ
                |	РегистрСведений.бит_СтавкиРефинансирования.СрезПоследних(&ДатаОбработки, ) КАК бит_СтавкиРефинансированияСрезПоследних
                |
                |УПОРЯДОЧИТЬ ПО
                |	Период УБЫВ";
				
 запрос.УстановитьПараметр("ДатаОбработки", ДатаСтавки);				
 
 таб = запрос.Выполнить().Выгрузить();
 ставкаРефинансирования = 0;	
 если таб.Количество() > 0 тогда	
  ставкаРефинансирования = таб[0].Ставка;	
 конецесли; 
 
 ставкаСтруктура.Вставить("Ставка",  ставкаРефинансирования);
 
 если ПериодСтавки.ЕдиницаСтавкиРефинансирования > 0 и
	    ПериодСтавки.ДоляСтавкиРефинансирования > 0 тогда
  ставкаСтруктура.Вставить("Процент",  ставкаРефинансирования*(ПериодСтавки.ЕдиницаСтавкиРефинансирования/ПериодСтавки.ДоляСтавкиРефинансирования));  
 иначе
  //если Объект.ПериодНачисления.ЕдиницаСтавкиРефинансирования > 0 тогда
   ставкаСтруктура.Вставить("Процент", 0);
  //конецесли; 
 конецесли; 
 
 возврат ставкаСтруктура;
  
КонецФункции // ПолучитьСтавкуРефинансирования()

&НаСервере
Процедура ПодборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Объект.Дата = ТекущаяДата();      Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	бит_НастройкаПараметровЖКХСрезПоследних.Организация
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, ) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата"       , КонецДня(Объект.Дата));	
	
	таб = Запрос.Выполнить().Выгрузить();
	если таб.Количество() > 0 тогда
		Объект.Организация = таб[0].Организация;
	конецесли;	

	ЗаполнитьТабличнуюЧасть();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()  	
	
  Для каждого ТекСтрока Из Объект.ТаблицаУслуг Цикл	
	  
	// БИТ ЖКХ 30.04.2020  
	МенеджерЗаписи = РегистрыСведений.бит_ПениПоУслугамЖКХ.СоздатьМенеджерЗаписи();
			
	МенеджерЗаписи.Период		     = Объект.Дата;
	МенеджерЗаписи.Организация       = Объект.Организация;			
	МенеджерЗаписи.ПериодНачисления  = Объект.ПериодНачисления; 
			
	ЗаполнитьЗначенияСвойств(МенеджерЗаписи, ТекСтрока);
			
	// Попытаемся записать менеджер записи.
	ОтказЗаписи = Ложь;
	
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		ТекстСообщения = "Не удалось записать значение настройки """ + ТекСтрока.Настройка + """: ";
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения + ОписаниеОшибки(), ОтказЗаписи);
	КонецПопытки;
	
  конеццикла;	

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТабличнуюЧасть()
	
	Объект.ТаблицаУслуг.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата"        , Объект.Дата);        
	Запрос.УстановитьПараметр("Организация" , Объект.Организация);
	Запрос.УстановитьПараметр("ПериодНачисления" , Объект.ПериодНачисления);
	
	Запрос.Текст = "ВЫБРАТЬ 
	               |	бит_ПениПоУслугамЖКХСрезПоследних.Период КАК Период,
	               |	бит_ПениПоУслугамЖКХСрезПоследних.Организация КАК Организация,
	               |	бит_ПениПоУслугамЖКХСрезПоследних.Услуга КАК Услуга,
	               |	бит_ПениПоУслугамЖКХСрезПоследних.Начислять КАК Начислять,
	               |	бит_ПениПоУслугамЖКХСрезПоследних.Процент КАК Процент,
	               |	бит_ПениПоУслугамЖКХСрезПоследних.ПериодНачисления КАК ПериодНачисления
	               |ИЗ
	               |	РегистрСведений.бит_ПениПоУслугамЖКХ.СрезПоследних (&Дата,
	               |	                             Организация = &Организация ) КАК бит_ПениПоУслугамЖКХСрезПоследних";
			
	Результат = Запрос.Выполнить().Выгрузить();
	периодНачисления = справочники.бит_ПериодыНачисленияПени.НайтиПоНаименованию("1 месяц");
	Объект.ПериодНачисления = периодНачисления;
	если Результат.Количество() > 0 тогда 
	 Результат.Сортировать("Период");
	 если Результат[0].ПериодНачисления <> справочники.бит_ПериодыНачисленияПени.ПустаяСсылка() тогда
	  периодНачисления = Результат[0].ПериодНачисления;
	  Объект.ПериодНачисления = периодНачисления;
	 конецесли; 
	конецесли;   	

	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_УслугиЖКХ.Ссылка КАК Услуга,
	               |	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.Начислять, ЛОЖЬ) КАК Начислять,
	               |	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.Процент, 0) КАК Процент,
	               |	ЛОЖЬ КАК НовЗначение,
	               |	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.Начислять, ЛОЖЬ) КАК НачислятьДо,
	               |	ЕСТЬNULL(бит_ПениПоУслугамЖКХСрезПоследних.Процент, 0) КАК ПроцентДо
	               |ИЗ
	               |	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_ПениПоУслугамЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_ПениПоУслугамЖКХСрезПоследних
	               |		ПО бит_УслугиЖКХ.Ссылка = бит_ПениПоУслугамЖКХСрезПоследних.Услуга
	               |ГДЕ
	               |	НЕ бит_УслугиЖКХ.Ссылка = ЗНАЧЕНИЕ(Справочник.бит_УслугиЖКХ.Пеня)
	               |	И бит_ПениПоУслугамЖКХСрезПоследних.ПериодНачисления = &ПериодНачисления";
	
	Запрос.УстановитьПараметр("ПериодНачисления", ПериодНачисления);
	Результат = Запрос.Выполнить().Выгрузить();

	
	для каждого стр из Результат цикл
		НоваяСтрока = Объект.ТаблицаУслуг.Добавить();
				
		НоваяСтрока.Услуга = стр.Услуга;
		НоваяСтрока.Начислять = стр.Начислять;
				
		ставкаПроцент = ПолучитьСтавкуРефинансирования(Объект.Дата, Объект.ПериодНачисления);  	
		НоваяСтрока.Процент = ставкаПроцент.Процент;
		НоваяСтрока.Ставка = ставкаПроцент.Ставка;
	конеццикла;		
		
КонецПроцедуры


&НаСервере
Процедура ДатаОбработкаВыбораНаСервере(ВыбранноеЗначение)
	для каждого стр из Объект.ТаблицаУслуг цикл						
	 если стр.Начислять = истина тогда
		ставкаПроцент = ПолучитьСтавкуРефинансирования(ВыбранноеЗначение, Объект.ПериодНачисления);  	
		стр.Процент = ставкаПроцент.Процент;
		стр.Ставка = ставкаПроцент.Ставка;
	 конецесли;	
	конеццикла;	
КонецПроцедуры


&НаКлиенте
Процедура ДатаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ДатаОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры


&НаКлиенте
Процедура Все(Команда)
	ВсеНаСервере();
КонецПроцедуры


&НаСервере
Процедура ВсеНаСервере()
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	бит_УслугиЖКХ.Ссылка КАК Услуга,
	               |	бит_УслугиЖКХ.ПометкаУдаления КАК ПометкаУдаления
	               |ИЗ
	               |	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
	               |ГДЕ
	               |	бит_УслугиЖКХ.ПометкаУдаления = ложь";
	
	списокУслуг = запрос.Выполнить().Выгрузить();
	
	списокСтавокУслуг = Объект.ТаблицаУслуг.Выгрузить();
	Объект.ТаблицаУслуг.Очистить();
	для каждого стр из списокУслуг цикл
		НоваяСтрока = Объект.ТаблицаУслуг.Добавить();
				
		НоваяСтрока.Услуга = стр.Услуга;
		НоваяСтрока.Начислять = НачислятьСтавку(списокСтавокУслуг, стр.Услуга);
		
		если НоваяСтрока.Начислять = истина тогда
		 ставкаПроцент = ПолучитьСтавкуРефинансирования(Объект.Дата, Объект.ПериодНачисления);  	
		 НоваяСтрока.Процент = ставкаПроцент.Процент;
		 НоваяСтрока.Ставка = ставкаПроцент.Ставка;
	    конецесли;
	 
	конеццикла;	
КонецПроцедуры

&НаСервере
функция НачислятьСтавку(списокСтавокУслуг, Услуга)
	
 Отбор = Новый Структура();
 Отбор.Вставить("Услуга", Услуга);
 строкиУслуг = списокСтавокУслуг.НайтиСтроки(Отбор);  	
 
 если строкиУслуг.Количество() > 0 тогда
  возврат строкиУслуг[0].Начислять;
 конецесли;

 возврат ложь;	
КонецФункции	

&НаСервере
Процедура ТаблицаУслугНачислятьПриИзмененииНаСервере(Данные)
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаУслугНачислятьПриИзменении(Элемент)
 		
  Отбор = Новый Структура();
  Отбор.Вставить("Услуга", Элементы.ТаблицаУслуг.ТекущиеДанные.Услуга);
  Отбор.Вставить("НомерСтроки", Элементы.ТаблицаУслуг.ТекущиеДанные.НомерСтроки);
  
  строкиУслуг = Объект.ТаблицаУслуг.НайтиСтроки(Отбор);  	
 
  если строкиУслуг.Количество() > 0 тогда  
   если Элементы.ТаблицаУслуг.ТекущиеДанные.Начислять	= истина тогда	  
    ставкаПроцент = ПолучитьСтавкуРефинансирования(Объект.Дата, Объект.ПериодНачисления);  	
    строкиУслуг[0].Процент = ставкаПроцент.Процент;
    строкиУслуг[0].Ставка = ставкаПроцент.Ставка;
   иначе	
	строкиУслуг[0].Процент = 0;
    строкиУслуг[0].Ставка = 0;
   конецесли;	
  КонецЕсли;                                     
 	
КонецПроцедуры

&НаСервере
Процедура ПериодНачисленияОбработкаВыбораНаСервере(ВыбранноеЗначение)
	для каждого стр из Объект.ТаблицаУслуг цикл						
	 если стр.Начислять = истина тогда	
		ставкаПроцент = ПолучитьСтавкуРефинансирования(Объект.Дата, ВыбранноеЗначение);  	
		стр.Процент = ставкаПроцент.Процент;
		стр.Ставка = ставкаПроцент.Ставка;
	 конецесли;	
	конеццикла;	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачисленияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	ПериодНачисленияОбработкаВыбораНаСервере(ВыбранноеЗначение);
КонецПроцедуры
